Enums/ВидыВзаиморасчетовССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыВзаиморасчетовССотрудниками</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыплатаАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаВМежрасчетныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЗадолженностиПоЗарплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнеочередноеПогашениеЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальнаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВМежрасчетныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Невыплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыВзаиморасчетовССотрудниками/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает виды взаиморасчетов, являющимися выплатами зарплаты
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыВзаиморасчетовССотрудниками
//
Функция Выплаты() Экспорт
	
	Выплаты = Новый Массив;
	
	Выплаты.Добавить(ВыплатаАванса);
	Выплаты.Добавить(ВыплатаВМежрасчетныйПериод);
	Выплаты.Добавить(ВыплатаЗарплаты);
	
	Возврат Выплаты;
	
КонецФункции	

// Возвращает виды взаиморасчетов, являющимися возвратами направленной на выплату зарплаты
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыВзаиморасчетовССотрудниками
//
Функция Возвраты() Экспорт
	
	Выплаты = Новый Массив;
	
	Выплаты.Добавить(ВозвратАванса);
	Выплаты.Добавить(ВозвратВМежрасчетныйПериод);
	Выплаты.Добавить(ВозвратЗарплаты);
	
	Возврат Выплаты;
	
КонецФункции	

// Проверяет, что указанный вид взаиморасчетов является выплатой зарплаты
//
// Параметры:
//  ВидВзаиморасчетов - ПеречислениеСсылка.ВидыВзаиморасчетовССотрудниками
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоВыплата(ВидВзаиморасчетов) Экспорт
	Возврат Выплаты().Найти(ВидВзаиморасчетов) <> Неопределено
КонецФункции	

// Проверяет, что указанный вид взаиморасчетов является возвратом направленной на выплату зарплаты
//
// Параметры:
//  ВидВзаиморасчетов - ПеречислениеСсылка.ВидыВзаиморасчетовССотрудниками
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоВозврат(ВидВзаиморасчетов) Экспорт
	Возврат Возвраты().Найти(ВидВзаиморасчетов) <> Неопределено
КонецФункции	

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает вид взаиморасчетов, являющимся невыплатой для указанной выплаты.
// Для видов взаиморасчетов, не являющихся выплатами, возвращается Неопределено.
//
// Параметры:
//  ВидВзаиморасчетов - ПеречислениеСсылка.ВидыВзаиморасчетовССотрудниками
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыВзаиморасчетовССотрудниками, Неопределено
//
Функция Невыплата(ВидВзаиморасчетов) Экспорт
	
	Если ВидВзаиморасчетов = ВыплатаАванса Тогда
		Возврат ВозвратАванса
	ИначеЕсли ВидВзаиморасчетов = ВыплатаВМежрасчетныйПериод Тогда
		Возврат ВозвратВМежрасчетныйПериод
	ИначеЕсли ВидВзаиморасчетов = ВыплатаЗарплаты Тогда
		Возврат ВозвратЗарплаты
	КонецЕсли;	
	
	Возврат Неопределено
	
КонецФункции	

#КонецОбласти

#КонецЕсли
